{
  "id": "fase-5-catastro",
  "title": "FASE 5: MÓDULO DE CATASTRO Y ORDENAMIENTO TERRITORIAL",
  "description": "Mantiene un registro digital y georreferenciado de todos los inmuebles del municipio y gestiona el cumplimiento de las normativas urbanísticas.",
  "details": [
    "Desarrollar la ficha catastral digital para cada inmueble con toda su información detallada.",
    "Implementar un Sistema de Información Geográfica (SIG) para visualizar el mapa del municipio con diferentes capas de información (parcelas, zonificación, servicios).",
    "Crear un sistema para registrar y consultar las 'Variables Urbanas Fundamentales' por zona o parcela.",
    "Digitalizar y gestionar el flujo completo de solicitud y aprobación de permisos de construcción.",
    "Integrar el catastro con el módulo de gestión tributaria para el cálculo del impuesto sobre inmuebles."
  ],
  "dependencies": ["fase-0-core"],
  "status": "done",
  "acceptance_criteria": [
    "Se puede buscar y visualizar la ficha catastral completa de cualquier inmueble en el sistema.",
    "El mapa SIG carga correctamente y permite activar/desactivar capas de información.",
    "Al consultar una parcela, el sistema muestra automáticamente las normativas urbanísticas que le aplican.",
    "El flujo de permisos de construcción funciona de principio a fin, desde la solicitud hasta la aprobación.",
    "La API del módulo de catastro tiene un coverage de tests superior al 70%.",
    "Los datos del catastro están disponibles para otros módulos que lo requieran."
  ],
  "subtasks": [
    {
      "id": "f5-sub1",
      "title": "Diseño del Schema de Base de Datos de Catastro",
      "description": "Definir modelos para Property (inmueble), Owner (propietario), UrbanVariables (variables urbanas por zona), ConstructionPermit (permiso de construcción), Inspection (inspección). Incluir coordenadas geográficas y relaciones con tributario.",
      "status": "done",
      "dependencies": []
    },
    {
      "id": "f5-sub2",
      "title": "Ejecutar Migración de Base de Datos",
      "description": "Ejecutar 'prisma migrate dev' para crear las tablas de catastro en PostgreSQL.",
      "status": "done",
      "dependencies": ["f5-sub1"]
    },
    {
      "id": "f5-sub3",
      "title": "Implementar API de Ficha Catastral",
      "description": "Desarrollar CRUD para fichas catastrales: ubicación, coordenadas, linderos, áreas, uso, servicios, estado, propietarios históricos, documentación.",
      "status": "done",
      "dependencies": ["f5-sub2"]
    },
    {
      "id": "f5-sub4",
      "title": "Desarrollar API de Variables Urbanas",
      "description": "Crear gestión de normativas urbanísticas por zona: retiros, alturas, densidades, usos permitidos. Consulta por dirección o coordenadas.",
      "status": "done",
      "dependencies": ["f5-sub2"]
    },
    {
      "id": "f5-sub5",
      "title": "Implementar Sistema de Permisos de Construcción",
      "description": "Desarrollar flujo completo: solicitud, revisión técnica, verificación de cumplimiento de variables urbanas, aprobación, control de obra, conformidad final.",
      "status": "done",
      "dependencies": ["f5-sub3", "f5-sub4"]
    },
    {
      "id": "f5-sub6",
      "title": "Crear API de Control Urbano",
      "description": "Implementar registro de denuncias de construcciones ilegales, programación de inspecciones, notificaciones, sanciones, seguimiento.",
      "status": "done",
      "dependencies": ["f5-sub3"]
    },
    {
      "id": "f5-sub7",
      "title": "Escribir Tests del Backend de Catastro",
      "description": "Desarrollar tests unitarios y de integración para el módulo de catastro. Objetivo: >70% coverage.",
      "status": "done",
      "dependencies": ["f5-sub6"]
    },
    {
      "id": "f5-sub8",
      "title": "Integrar Sistema de Información Geográfica (SIG)",
      "description": "Implementar visualización de mapa con React Leaflet/Google Maps, capas de información (parcelas, zonificación, servicios), herramientas de medición, exportación de mapas.",
      "status": "done",
      "dependencies": []
    },
    {
      "id": "f5-sub9",
      "title": "Desarrollar Módulo de Gestión Catastral",
      "description": "Crear interfaz para gestionar fichas catastrales, búsqueda de inmuebles, actualización de datos, carga de documentos y fotos.",
      "status": "done",
      "dependencies": ["f5-sub8"]
    },
    {
      "id": "f5-sub10",
      "title": "Crear Portal de Consulta Pública",
      "description": "Desarrollar portal donde ciudadanos consulten zonificación, variables urbanas de su parcela, estado de trámites de permisos, descarguen formularios.",
      "status": "done",
      "dependencies": ["f5-sub8"]
    },
    {
      "id": "f5-sub11",
      "title": "Implementar Módulo de Permisos de Construcción",
      "description": "Crear interfaz para solicitar permisos online, subir planos, seguimiento del trámite, revisión técnica, aprobaciones, inspecciones.",
      "status": "done",
      "dependencies": ["f5-sub9"]
    },
    {
      "id": "f5-sub12",
      "title": "Escribir Tests del Frontend de Catastro",
      "description": "Desarrollar tests de componentes y flujos principales (consulta de ficha, solicitud de permiso, visualización en mapa).",
      "status": "done",
      "dependencies": ["f5-sub11"]
    }
  ]
}
